[
  {
    "id": 1,
    "title": "Assurance Associate",
    "company": "PwC Indonesia - Jakarta, Indonesia",
    "period": "July 2024 - Present",
    "tags": ["IT Audit", "Data Analytics", "Machine Learning"],
    "description": [
      "Conducted end-to-end IT audits (ITGC and ITAC) across industries including telecom and manufacturing, identifying control gaps and analyzing enterprise IT architectures and core business processes.",
      "Automated data workflows using Alteryx to streamline audit procedures, enabling faster and more data-driven risk assessments across multiple engagements.",
      "Collaborated with the data analytics team to build a scalable machine learning pipeline using PySpark for a well known Indonesian bank—translating modeling logic into optimized, production-ready code for big data processing."
    ],
    "order": 1
  },
  {
    "id": 2,
    "title": "Product Researcher Intern",
    "company": "Evomo - Bandung, Indonesia",
    "period": "September 2023 - February 2024",
    "tags": ["IoT", "Product Research", "Market Analysis"],
    "description": [
      "Conducted multiple research in the IoT Industry, focusing on enhancing manufacturing efficiency through analyses of overall equipment effectiveness and power monitoring systems.",
      "Led the development of a new subscription business flow by translating competitor benchmarking and user feedback into actionable product insights.",
      "Assessed product-market fit for a new IoT bootcamp initiative, resulting in a validated proposal supported by survey and trend analysis."
    ],
    "order": 2
  },
  {
    "id": 3,
    "title": "My Digital Academy Awardee",
    "company": "Bank Mandiri - Remote",
    "period": "December 2023 - January 2024",
    "tags": ["Fintech", "Prototyping", "Product Design"],
    "description": [
      "Designed a fintech prototype using Outsystem to improve children's financial literacy, applying key product principles such as user segmentation, wireframing, and MVP definition.",
      "Participated in product ideation sprints and presented product roadmaps to mentors for feedback and iteration."
    ],
    "order": 3
  },
  {
    "id": 4,
    "title": "IT Platform Operation Intern",
    "company": "Telkom International - Jakarta, Indonesia",
    "period": "June 2023 - September 2023",
    "tags": ["Monitoring", "Data Analytics", "IT Audit"],
    "description": [
      "Monitored the NeuTrafix marketplace using Grafana and developed data analytics for resource allocation in 2023.",
      "Utilized Python with the Pandas library to generate log summary from device log files and implemented an alert system using Telegram Bot for efficient device monitoring in Splunk.",
      "Involved in data governance activities, including the review and implementation of key documents from the parent company and actively participated in various IT audit activities alongside internal and external auditors."
    ],
    "order": 4
  },
  {
    "id": 5,
    "title": "Cloud Computing Cohort",
    "company": "Bangkit Academy 2023 - Remote",
    "period": "February 2023 - July 2023",
    "tags": ["Cloud Computing", "GCP", "Web Programming"],
    "description": [
      "Acquired computer networking, system administration, and web programming skills. Utilizing JavaScript and Google Cloud services to build dynamic web applications.",
      "Developed proficiency in cloud computing using Google Cloud Platform (GCP), specializing in architecting scalable and cost-efficient solutions.",
      "Applied cloud computing expertise and API development knowledge in the final capstone project called Promosee."
    ],
    "order": 5
  },
  {
    "id": 6,
    "title": "Information System Laboratory Assistant",
    "company": "ITB Information System Laboratory - Bandung, Indonesia",
    "period": "September 2022 - Present",
    "tags": ["Teaching", "Mentoring", "Project Management"],
    "description": [
      "Facilitate student-led projects covering various subjects related to the information system every semester.",
      "Guide students through the completion of projects by providing milestone-based supervision and corrections."
    ],
    "order": 6
  }
]