[
  {
    "id": 1,
    "title": "Risk Assurance Associate",
    "company": "PwC Indonesia - Jakarta, Indonesia",
    "logo": "images/logos/pwc.svg",
    "period": "July 2024 - Present",
    "tags": ["ITGC", "ITAC", "ICFR", "CAATs", "PySpark"],
    "description": [
      "Executed ITGC (access to programs and data, change management, computer operations, program development) and ITAC audits across SAP and non-SAP financial systems, supporting reliable financial reporting.",
      "Performed process walkthroughs, evidence review, and assessment of configuration-based and IT-dependent controls impacting financial reporting.",
      "Conducted journal entry testing and analytics using Alteryx, reducing manual testing effort by ~20–30% through structured filtering and anomaly identification.",
      "Applied CAATs using Alteryx to extract, validate, and analyze datasets with 100K+ records, improving audit coverage and consistency.",
      "Prepared and updated BPM and RCM documentation for ITGC processes as part of an ICFR implementation project.",
      "Coordinated with financial audit teams and senior associates across concurrent engagements during peak periods.",
      "Contributed to a PySpark-based pipeline on Cloudera/Hive for large-scale banking data analysis (1M+ monthly records)."
    ],
    "order": 1
  },
  {
    "id": 2,
    "title": "Information System Laboratory Assistant",
    "company": "ITB Information System Laboratory - Bandung, Indonesia",
    "logo": "images/logos/itb.svg",
    "period": "2022 - 2024",
    "tags": ["Mentoring", "System Analysis", "Enterprise Architecture"],
    "description": [
      "Mentored student projects in system analysis, enterprise architecture, UX/UI, SDLC, and project management.",
      "Guided project milestones and provided structured feedback."
    ],
    "order": 2
  },
  {
    "id": 3,
    "title": "IoT Product Researcher Intern",
    "company": "Evomo - Bandung, Indonesia",
    "logo": "images/logos/evomo.svg",
    "period": "September 2023 - February 2024",
    "tags": ["IoT", "Product Research", "Process Mapping", "Market Analysis"],
    "description": [
      "Conducted process mapping, requirement analysis, benchmarking, and user research to define features, user flows, and subscription concepts for an IoT energy monitoring platform.",
      "Conducted IoT industry research related to manufacturing efficiency and energy monitoring.",
      "Performed process mapping, requirement analysis, and competitor benchmarking.",
      "Translated research insights into product features and subscription concepts.",
      "Evaluated product-market fit using surveys and trend analysis."
    ],
    "order": 3
  },
  {
    "id": 4,
    "title": "IT Platform Operation Intern",
    "company": "Telkom International - Jakarta, Indonesia",
    "logo": "images/logos/telin.svg",
    "period": "June 2023 - September 2023",
    "tags": ["Python", "Monitoring", "Grafana", "IT Governance"],
    "description": [
      "Developed Python (Pandas) log-processing scripts for operational monitoring and integrated Telegram Bot API with Grafana alerts, improving incident response by ~30%.",
      "Built Python (Pandas) scripts for log processing and operational monitoring.",
      "Integrated Grafana alerts with Telegram Bot API, improving incident response time.",
      "Supported IT data governance, audit coordination, and operational documentation.",
      "Participated in IT operations monitoring and documentation."
    ],
    "order": 4
  },
  {
    "id": 5,
    "title": "My Digital Academy Awardee",
    "company": "Bank Mandiri - Remote",
    "logo": "images/logos/mandiri.svg",
    "period": "December 2023 - January 2024",
    "tags": ["Fintech", "Product Design", "Prototyping"],
    "description": [
      "Selected participant in fintech product development program.",
      "Designed a financial literacy prototype for teenagers and applied product principles (user segmentation, wireframing, MVP definition)."
    ],
    "order": 5
  },
  {
    "id": 6,
    "title": "Cloud Computing Cohort",
    "company": "Bangkit Academy 2023 - Remote",
    "logo": "images/logos/bangkit.svg",
    "period": "February 2023 - July 2023",
    "tags": ["Cloud Computing", "GCP", "Web Programming"],
    "description": [
      "Learned cloud computing, networking, system administration, and web programming.",
      "Built and deployed cloud-native applications using Google Cloud Platform (GCP).",
      "Contributed to the Promosee capstone project (cloud + ML)."
    ],
    "order": 6
  }
]
